Repository: Stepa28/Auth
Catalog: Auth.Resources/ExceptionAndLogMessages.*.resx
Languages: ru

# UnresolvedIp
source: Your ip is not registered
ru: Ваш ip не зарегистрирован

# FailedIdentifyNoHead
source: Failed to identify service (no head)
ru: Не удалось идентифицировать сервис (нет заголовока)

# EmailNotFound
source: Entity with e-mail = {0} not found
ru: Объект с адресом электронной почты = {0} не найден

# FailedInitializationLeads
source: Initialization leads with {0} and {1} failed
ru: Инициализация lead через {0} и {1} не удалось

# AlertSent
source: Initialization failure alert sent
ru: Отправлено предупреждение об ошибке инициализации

# AttemptInitialize
source: Attempt to initialize from {0} service
ru: Попытка инициализации из сервиса {0}

# AttemptInitializeConfigs
source: Attempt to initialize configs from {0} service
ru: Попытка инициализировать конфигурации из сервиса {0}

source: Broken token
ru: Сломанный токен

# BrokenTokenDecoding
source: Token doesn't contain claims, possible expiration or incorrect secret key
ru: Токен не содержит claims, возможного истечения срока действия или неправильного секретного ключа

source: Change role Leads
ru: Изменение ролей Leads

# ConfigurationChange
source: Configuration {0} change value {1} to {2}
ru: Конфигурация {0} изменить значение с {1} на {2}

# DontHaveAccess
source: You don't have access to {0}
ru: У вас нет доступа к {0}

# FailedIdentifyInvalidHead
source: Failed to identify service (invalid head)
ru: Не удалось идентифицировать сервис (неверный заголовок)

# FailedInitialize
source: Failed to initialize from {0} service ({1})
ru: Не удалось инициализировать через сервис {0} ({1})

# FailedInitializeConfigs
source: Failed to initialize configs from {0} service ({1})
ru: Не удалось инициализировать конфигурации из сервиса {0} ({1})

# InitializeLeadsSuccessfully
source: Initialization leads: completed successfully
ru: Инициализация leads: завершено успешно

# InitializeLeadsWasNotCompleted
source: Microservice initialize leads was not completed
ru: Инициализация leads микросервиса не завершена

# InitializeSuccessfully
source: Initialize from {0} service: completed successfully
ru: Инициализация из службы {0}: завершена успешно

# NotAudiences
source: Not contain from audiences ({0})
ru: Токен не содержит audiences ({0})

# PasswordIsIncorrected
source: Incorrected password
ru: Неверный пароль

# ReceivedToken
source: Received a token for a lead with email = {0} ({1})
ru: Получен токен для входа с адресом электронной почты = {0} ({1})

# ReceiveTokenForMicroservices
source: {0} service requested to receive a token for microservices
ru: Служба {0} запросила получение токена для микросервиса

# RemoveLead
source: Remove Lead with id = {0}
ru: Удалить интерес с идентификатором = {0}

# ReportFailedInitialization
source: Attempt to report failed initialization
ru: Попытка сообщить о неудачной инициализации

# RequestValidateToken
source: Received a request to validate a microservices token from {0}
ru: Получен запрос на проверку токена микросервисов от {0}.

# ResponseSuccessfully
source: Response from service {0}: received successfully
ru: Ответ от службы {0}: получен успешно

source: Token contains invalid data
ru: Токен содержит неверные данные

# TokenDoesntAudience
source: Token doesn't contain audience
ru: Токен не содержит audience

# TokenDoubleValidation
source: Token double validation request received({0})
ru: Получен запрос на двойную проверку токена ({0})

# VerificationSuccessful
source: Verification token was successful
ru: Токен проверки прошел успешно

# FrontRequestValidateToken
source: Frontend token validation request received ({0})
ru: Получен запрос проверки токена Frontend-ом ({0})

# TokenWasNotIssuedForService
source: The token was not issued for {0} service ({1})
ru: Токен не был выпущен для службы {0} ({1})

# FrontendDoesntAccess
source: {0} does not have access
ru: У {0} нет доступа к сервису пославшему запрос

# AuthRequestModelIsNull
source: You must specify the auth details in the request body
ru: Вы должны указать данные авторизации в теле запроса

source: Token sent
ru: Токен отправлен

source: Hash password send
ru: Хэш-пароль отправлен

# RequestTokenByAuthRequestModel
source: Received a request to receive a token by AuthRequestModel = {0}
ru: Получен запрос на получение токена из AuthRequestModel = {0}

# ReceivedVerifyTokenIssuedByMarvelousAuth
source: Request received to verify token issued by MarvelousAuth
ru: Получен запрос на проверку токена, выпущенного MarvelousAuth.

# FailedToGetLeadData
source: Failed to get lead data from token ({0})
ru: Не удалось получить данные о лидах из токена ({0})

# ReceivedRequestHashingPassword
source: {0} asked to hashing password
ru: {0} попросил хешировать пароль

# PasswordIsNull
source: You must specify the password details in the request body
ru: Вы должны указать данные пароля в теле запроса
